{
  "architectures": [
    "TextCNN"
  ],
  "dropout": 0.5,
  "embed_dim": 300,
  "kernel_nums": [
    128,
    128,
    128,
    128,
    128
  ],
  "kernel_sizes": [
    2,
    3,
    4,
    5,
    6
  ],
  "model_type": "TextCNN",
  "num_classes": 31,
  "torch_dtype": "float32",
  "transformers_version": "4.18.0",
  "vocab_size": 30522
}
